Бухгалтерские_задачи_Занятие_5/src/Documents/ПриобретениеТоваровИУслуг/ПриобретениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриобретениеТоваровИУслуг</name>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Счета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Бухгалтерские_задачи_Занятие_5/src/AccountingRegisters/Проводки/Проводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Проводки</name>
  <chartOfAccounts>ChartOfAccounts.Счета</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.ПоПодразделениям</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Бухгалтерские_задачи_Занятие_5/src/ChartsOfAccounts/Счета/Счета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Счета</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
      <code>10</code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
      <childItems>
        <name>ТоварыОпт</name>
        <description>Товары опт</description>
        <code>41.1</code>
      </childItems>
      <childItems>
        <name>ТоварыРозница</name>
        <description>Товары розница</description>
        <code>41.2</code>
      </childItems>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
    </items>
    <items>
      <name>СчетВБанке</name>
      <description>Счет в банке</description>
      <code>51</code>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ПокупателямОтгрузили</name>
        <description>Покупателям отгрузили</description>
        <code>62.1</code>
      </childItems>
      <childItems>
        <name>АвансОтПокупателей</name>
        <description>Аванс от покупателей</description>
        <code>62.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ЗарплатаСотрудников</name>
      <description>Зарплата сотрудников</description>
      <code>70</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыСУчредителями</name>
      <description>Расчеты с учредителями</description>
      <code>75</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>УставныйКапитал</name>
      <description>Уставный капитал</description>
      <code>80</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасходыДоходы</name>
      <description>Расходы доходы</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ХранениеТоваров</name>
      <description>Хранение товаров</description>
      <code>001</code>
      <offBalance>true</offBalance>
    </items>
  </predefined>
  <attributes>
    <name>НеИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>ПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
</mdclass:ChartOfAccounts>

Бухгалтерские_задачи_Занятие_5/src/Documents/ПриобретениеТоваровИУслуг/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Проводки.Записывать = Истина;
	

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Движение = Движения.Проводки.Добавить();
		
		//--Общие для проводки -----
		
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.СодержаниеПроводки = "Поступили ТМЦ";
		Движение.Организация = Организация;
		
		//--Дебет -----
		Движение.СчетДт = ТекСтрокаТовары.СчетУчета;

		Бухгалтерия.ЗаполнитьПодразделениеСтороныПроводки(Движение,Подразделение,"Дт");
		
		Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(Движение,"Номенклатура", ТекСтрокаТовары.Номенклатура, "Дт");
		Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(Движение,"Склады", Склад, "Дт");
		Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(Движение,"Контрагенты", Контрагент, "Дт");
		
		Бухгалтерия.ЗаполнитьКоличествоСтороныПроводки(Движение, ТекСтрокаТовары.Количество, "Дт");
		//--Кредит ----
		Если Не ТекСтрокаТовары.СчетУчета.Забалансовый Тогда
		
			Движение.СчетКт = ПланыСчетов.Счета.Поставщики;
			Бухгалтерия.ЗаполнитьПодразделениеСтороныПроводки(Движение,Подразделение,"Кт");
			
			Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(Движение,"Контрагенты", Контрагент, "Кт");
			Бухгалтерия.ЗаполнитьСубконтоСтороныПроводки(Движение,"Договоры", Договор, "Кт");
			
			Бухгалтерия.ЗаполнитьКоличествоСтороныПроводки(Движение, ТекСтрокаТовары.Количество, "Кт");

		КонецЕсли; 
		
		
	КонецЦикла;

КонецПроцедуры
